In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('example')

In [11]:
df.to_excel('new.xlsx',sheet_name= 'sheet 1',index=False)

In [12]:
new = pd.read_excel('new.xlsx')

In [15]:
new

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
new['new_col'] = (6,6,6,np.nan)

In [24]:
new

    a   b   c   d  new_col
0   0   1   2   3      6.0
1   4   5   6   7      6.0
2   8   9  10  11      6.0
3  12  13  14  15      NaN

In [30]:
new[new > 2]

      a     b     c   d  new_col
0   NaN   NaN   NaN   3      6.0
1   4.0   5.0   6.0   7      6.0
2   8.0   9.0  10.0  11      6.0
3  12.0  13.0  14.0  15      NaN

In [33]:
new.fillna(new['new_col'].mean())

    a   b   c   d  new_col
0   0   1   2   3      6.0
1   4   5   6   7      6.0
2   8   9  10  11      6.0
3  12  13  14  15      6.0